HeartTalks/app/Controllers/Auth.php

    public function login()
    {
        helper(['form']);

        $data = [];

        // check if form is submitted via POST
        if ($this->request->getMethod() == 'POST') {

            // get input values from login form
            $username = $this->request->getPost('username');
            $password = $this->request->getPost('password');

            $userModel = new UserModel();

            // check if username exists in database
            $user = $userModel
                ->where('username', $username)
                ->first();
---
SELECT *
FROM `users`
WHERE `username` = 'mars'
 LIMIT 1