HeartTalks/app/Controllers/Home.php

SELECT *
FROM `reactions`
WHERE `user_id` = '1'
AND `post_id` = '1'
 LIMIT 1
---
    public function index()
    {
        // load models for posts, reactions, and comments
        $postModel = new PostModel();
        $reactionModel = new ReactionModel();
        $commentModel = new CommentModel();

        // get logged-in user ID from session
        $userid = session()->get('userid');

        if ($this->request->getGet('react') && $this->request->getGet('type')) {

    $postid = $this->request->getGet('react');
    $type   = $this->request->getGet('type');

    $allowed = ['like','love','haha','sad','angry'];

    if (in_array($type, $allowed)) {

        $existing = $reactionModel
            ->where('user_id', $userid)
            ->where('post_id', $postid)
            ->first();

INSERT INTO `reactions` (`user_id`, `post_id`, `type`) VALUES ('1', '1', 'love')
---
            ]);
        } else {
            // insert reaction
            $reactionModel->save([
                'user_id' => $userid,
                'post_id' => $postid,
                'type' => $type
            ]);

SELECT `posts`.*, `users`.`fullname`
FROM `posts`
JOIN `users` ON `users`.`id` = `posts`.`user_id`
ORDER BY `posts`.`id` DESC
---
        }

        //LOAD POSTS
        $data['posts'] = $postModel
            ->select('posts.*, users.fullname')
            ->join('users', 'users.id = posts.user_id')
            ->orderBy('posts.id', 'DESC')
            ->findAll();