HeartTalks/app/Controllers/Profile.php

SELECT *
FROM `friend_requests`
WHERE `sender_id` = '4'
AND `receiver_id` = '1'
 LIMIT 1
---
    public function index()
    {
        // check if user is logged in
        if (!session()->get('userid')) {
            return redirect()->to('/');
        }

        // get logged-in user ID
        $userid = session()->get('userid');

        // load models
        $friendModel = new FriendModel();
        $requestModel = new FriendRequestModel();
        $userModel = new UserModel();

        // ADD FRIEND
        if ($this->request->getGet('add')) {

            $target = $this->request->getGet('add');

             // prevent sending request to self
            if ($target != $userid) {

                // check if request already exists
                $exists = $requestModel
                    ->where('sender_id', $userid)
                    ->where('receiver_id', $target)
                    ->first();

SELECT `friend_requests`.*, `users`.`fullname`
FROM `friend_requests`
JOIN `users` ON `friend_requests`.`sender_id` = `users`.`id`
WHERE `receiver_id` = '4'
SELECT `friends`.`id`, `users`.`fullname`
FROM `friends`
INNER JOIN users ON (
                (users.id = friends.user1 AND friends.user2 = 4)
                OR
                (users.id = friends.user2 AND friends.user1 = 4)
            )
---
            ->findAll();

            // incoming friend requests
        $requests = $requestModel
            ->select('friend_requests.*, users.fullname')
            ->join('users', 'friend_requests.sender_id = users.id')
            ->where('receiver_id', $userid)
            ->findAll();

            // friends list
        $friends = $friendModel
            ->select('friends.id, users.fullname')
            ->join('users', "(
                (users.id = friends.user1 AND friends.user2 = $userid)
                OR
                (users.id = friends.user2 AND friends.user1 = $userid)
            )", 'inner', false)
            ->findAll();