HeartTalks/app/Views/home.php

            $postid = $row['id'];

            // get all reactions for this post
            $reactions = $reactionModel->where('post_id', $postid)->findAll();
---
SELECT *
FROM `reactions`
WHERE `post_id` = '1'

                ->first();

            // get comments with user names
            $comments = $commentModel
                ->select('comments.*, users.fullname')
                ->join('users', 'users.id = comments.user_id')
                ->where('post_id', $postid)
                ->orderBy('comments.id', 'ASC')
                ->findAll();
---
SELECT `comments`.*, `users`.`fullname`
FROM `comments`
JOIN `users` ON `users`.`id` = `comments`.`user_id`
WHERE `post_id` = '1'
ORDER BY `comments`.`id` ASC